app/views/projects/index.html.erb

            <div class="sortable-projects" data-url="<%= sort_project_path(project.id) %>">
              <% project.projects.each do |subproj| %>
---
SELECT "projects".* FROM "projects"