app/controllers/projects_controller.rb

INSERT INTO "projects" ("title", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["title", "Newest Project"], ["created_at", "2018-06-08 17:55:48.541671"], ["updated_at", "2018-06-08 17:55:48.541671"]]
---
  def create
    @project = Project.new(projects_params)
    if @project.save